kalan-innovive/blower_burn_in/SDK_Attempts/sdkconfig.defaults.bak
CONFIG_EXAMPLE_WIFI_CONNECT_AP_BY_SIGNAL=y
# CONFIG_EXAMPLE_WIFI_CONNECT_AP_BY_SECURITY is not set
# CONFIG_EXAMPLE_CONNECT_ETHERNET is not set
# end of Example Connection Configuration

#
# ESP Speech Recognition
#
CONFIG_MODEL_IN_FLASH=y
# CONFIG_MODEL_IN_SDCARD is not set
CONFIG_USE_AFE=y
CONFIG_AFE_INTERFACE_V1=y
# CONFIG_USE_NSNET is not set
CONFIG_USE_WAKENET=y
# CONFIG_SR_WN_WN8_ALEXA is not set
# CONFIG_SR_WN_WN9_HILEXIN is not set
# CONFIG_SR_WN_WN9_XIAOAITONGXUE is not set
# CONFIG_SR_WN_WN9_ALEXA is not set
# CONFIG_SR_WN_WN9_HIESP is not set
# CONFIG_SR_WN_WN9_HIMFIVE is not set
# CONFIG_SR_WN_WN9_NIHAOXIAOZHI is not set
# CONFIG_SR_WN_WN9_JARVIS_TTS is not set
# CONFIG_SR_WN_WN9_COMPUTER_TTS is not set
# CONFIG_SR_WN_WN9_HEYWILLOW_TTS is not set
# CONFIG_SR_WN_WN9_SOPHIA_TTS is not set
# CONFIG_SR_WN_WN9_NIHAOXIAOXIN_TTS is not set
# CONFIG_SR_WN_WN9_XIAOMEITONGXUE_TTS is not set
# CONFIG_SR_WN_WN9_HIXIAOXING_TTS is not set
# CONFIG_SR_WN_WN9_MYCROFT_TTS is not set
# CONFIG_SR_WN_WN9_HEYPRINTER_TTS is not set
# CONFIG_SR_WN_WN9_XIAOLONGXIAOLONG_TTS is not set
# CONFIG_SR_WN_WN9_CUSTOMWORD is not set
CONFIG_SR_WN_LOAD_MULIT_WORD=y

#
# Load Multiple Wake Words
#
CONFIG_SR_WN_WN9_HILEXIN_MULTI=y
# CONFIG_SR_WN_WN9_XIAOAITONGXUE_MULTI is not set
# CONFIG_SR_WN_WN9_ALEXA_MULTI is not set
CONFIG_SR_WN_WN9_HIESP_MULTI=y
# CONFIG_SR_WN_WN9_JARVIS_TTS_MULTI is not set
# CONFIG_SR_WN_WN9_COMPUTER_TTS_MULTI is not set
# CONFIG_SR_WN_WN9_HEYWILLOW_TTS_MULTI is not set
# CONFIG_SR_WN_WN9_SOPHIA_TTS_MULTI is not set
# CONFIG_SR_WN_WN9_NIHAOXIAOXIN_TTS_MULTI is not set
# CONFIG_SR_WN_WN9_XIAOMEITONGXUE_TTS_MULTI is not set
# CONFIG_SR_WN_WN9_HEYPRINTER_TTS_MULTI is not set
# CONFIG_SR_WN_WN9_XIAOLONGXIAOLONG_TTS_MULTI is not set
# CONFIG_SR_WN_WN9_MYCROFT_TTS_MULTI is not set
# end of Load Multiple Wake Words

CONFIG_USE_MULTINET=y
# CONFIG_SR_MN_CN_NONE is not set
CONFIG_SR_MN_CN_MULTINET5_RECOGNITION_QUANT8=y
# CONFIG_SR_MN_CN_MULTINET6_QUANT is not set
# CONFIG_SR_MN_CN_MULTINET6_AC_QUANT is not set
# CONFIG_SR_MN_CN_MULTINET7_QUANT is not set
# CONFIG_SR_MN_CN_MULTINET7_AC_QUANT is not set
# CONFIG_SR_MN_EN_NONE is not set
CONFIG_SR_MN_EN_MULTINET5_SINGLE_RECOGNITION_QUANT8=y
# CONFIG_SR_MN_EN_MULTINET6_QUANT is not set
# CONFIG_SR_MN_EN_MULTINET7_QUANT is not set

#
# Add Chinese speech commands
#
CONFIG_CN_SPEECH_COMMAND_ID0="da kai kong tiao"
CONFIG_CN_SPEECH_COMMAND_ID1="guan bi kong tiao"
CONFIG_CN_SPEECH_COMMAND_ID2="zeng da feng su"
CONFIG_CN_SPEECH_COMMAND_ID3="jian xiao feng su"
CONFIG_CN_SPEECH_COMMAND_ID4="sheng gao yi du"
CONFIG_CN_SPEECH_COMMAND_ID5="jiang di yi du"
CONFIG_CN_SPEECH_COMMAND_ID6="zhi re mo shi"
CONFIG_CN_SPEECH_COMMAND_ID7="zhi leng mo shi"
CONFIG_CN_SPEECH_COMMAND_ID8="song feng mo shi"
CONFIG_CN_SPEECH_COMMAND_ID9="jie neng mo shi"
CONFIG_CN_SPEECH_COMMAND_ID10="chu shi mo shi"
CONFIG_CN_SPEECH_COMMAND_ID11="jian kang mo shi"
CONFIG_CN_SPEECH_COMMAND_ID12="shui mian mo shi"
CONFIG_CN_SPEECH_COMMAND_ID13="da kai lan ya"
CONFIG_CN_SPEECH_COMMAND_ID14="guan bi lan ya"
CONFIG_CN_SPEECH_COMMAND_ID15="kai shi bo fang"
CONFIG_CN_SPEECH_COMMAND_ID16="zan ting bo fang"
CONFIG_CN_SPEECH_COMMAND_ID17="ding shi yi xiao shi"
CONFIG_CN_SPEECH_COMMAND_ID18="da kai dian deng"
CONFIG_CN_SPEECH_COMMAND_ID19="guan bi dian deng"
CONFIG_CN_SPEECH_COMMAND_ID20=""
CONFIG_CN_SPEECH_COMMAND_ID21=""
CONFIG_CN_SPEECH_COMMAND_ID22=""
CONFIG_CN_SPEECH_COMMAND_ID23=""
CONFIG_CN_SPEECH_COMMAND_ID24=""
CONFIG_CN_SPEECH_COMMAND_ID25=""
CONFIG_CN_SPEECH_COMMAND_ID26=""
CONFIG_CN_SPEECH_COMMAND_ID27=""
CONFIG_CN_SPEECH_COMMAND_ID28=""
CONFIG_CN_SPEECH_COMMAND_ID29=""
CONFIG_CN_SPEECH_COMMAND_ID30=""
CONFIG_CN_SPEECH_COMMAND_ID31=""
CONFIG_CN_SPEECH_COMMAND_ID32=""
CONFIG_CN_SPEECH_COMMAND_ID33=""
CONFIG_CN_SPEECH_COMMAND_ID34=""
CONFIG_CN_SPEECH_COMMAND_ID35=""
CONFIG_CN_SPEECH_COMMAND_ID36=""
CONFIG_CN_SPEECH_COMMAND_ID37=""
CONFIG_CN_SPEECH_COMMAND_ID38=""
CONFIG_CN_SPEECH_COMMAND_ID39=""
CONFIG_CN_SPEECH_COMMAND_ID40=""
CONFIG_CN_SPEECH_COMMAND_ID41=""
CONFIG_CN_SPEECH_COMMAND_ID42=""
CONFIG_CN_SPEECH_COMMAND_ID43=""
CONFIG_CN_SPEECH_COMMAND_ID44=""
CONFIG_CN_SPEECH_COMMAND_ID45=""
CONFIG_CN_SPEECH_COMMAND_ID46=""
CONFIG_CN_SPEECH_COMMAND_ID47=""
CONFIG_CN_SPEECH_COMMAND_ID48=""
CONFIG_CN_SPEECH_COMMAND_ID49=""
CONFIG_CN_SPEECH_COMMAND_ID50=""
CONFIG_CN_SPEECH_COMMAND_ID51=""
CONFIG_CN_SPEECH_COMMAND_ID52=""
CONFIG_CN_SPEECH_COMMAND_ID53=""
CONFIG_CN_SPEECH_COMMAND_ID54=""
CONFIG_CN_SPEECH_COMMAND_ID55=""
CONFIG_CN_SPEECH_COMMAND_ID56=""
CONFIG_CN_SPEECH_COMMAND_ID57=""
CONFIG_CN_SPEECH_COMMAND_ID58=""
CONFIG_CN_SPEECH_COMMAND_ID59=""
CONFIG_CN_SPEECH_COMMAND_ID60=""
CONFIG_CN_SPEECH_COMMAND_ID61=""
CONFIG_CN_SPEECH_COMMAND_ID62=""
CONFIG_CN_SPEECH_COMMAND_ID63=""
CONFIG_CN_SPEECH_COMMAND_ID64=""
CONFIG_CN_SPEECH_COMMAND_ID65=""
CONFIG_CN_SPEECH_COMMAND_ID66=""
CONFIG_CN_SPEECH_COMMAND_ID67=""
CONFIG_CN_SPEECH_COMMAND_ID68=""
CONFIG_CN_SPEECH_COMMAND_ID69=""
CONFIG_CN_SPEECH_COMMAND_ID70=""
CONFIG_CN_SPEECH_COMMAND_ID71=""
CONFIG_CN_SPEECH_COMMAND_ID72=""
CONFIG_CN_SPEECH_COMMAND_ID73=""
CONFIG_CN_SPEECH_COMMAND_ID74=""
CONFIG_CN_SPEECH_COMMAND_ID75=""
CONFIG_CN_SPEECH_COMMAND_ID76=""
CONFIG_CN_SPEECH_COMMAND_ID77=""
CONFIG_CN_SPEECH_COMMAND_ID78=""
CONFIG_CN_SPEECH_COMMAND_ID79=""
CONFIG_CN_SPEECH_COMMAND_ID80=""
CONFIG_CN_SPEECH_COMMAND_ID81=""
CONFIG_CN_SPEECH_COMMAND_ID82=""
CONFIG_CN_SPEECH_COMMAND_ID83=""
CONFIG_CN_SPEECH_COMMAND_ID84=""
CONFIG_CN_SPEECH_COMMAND_ID85=""
CONFIG_CN_SPEECH_COMMAND_ID86=""
CONFIG_CN_SPEECH_COMMAND_ID87=""
CONFIG_CN_SPEECH_COMMAND_ID88=""
CONFIG_CN_SPEECH_COMMAND_ID89=""
CONFIG_CN_SPEECH_COMMAND_ID90=""
CONFIG_CN_SPEECH_COMMAND_ID91=""
CONFIG_CN_SPEECH_COMMAND_ID92=""
CONFIG_CN_SPEECH_COMMAND_ID93=""
CONFIG_CN_SPEECH_COMMAND_ID94=""
CONFIG_CN_SPEECH_COMMAND_ID95=""
CONFIG_CN_SPEECH_COMMAND_ID96=""
CONFIG_CN_SPEECH_COMMAND_ID97=""
CONFIG_CN_SPEECH_COMMAND_ID98=""
CONFIG_CN_SPEECH_COMMAND_ID99=""
CONFIG_CN_SPEECH_COMMAND_ID100=""
CONFIG_CN_SPEECH_COMMAND_ID101=""
CONFIG_CN_SPEECH_COMMAND_ID102=""
CONFIG_CN_SPEECH_COMMAND_ID103=""
CONFIG_CN_SPEECH_COMMAND_ID104=""
CONFIG_CN_SPEECH_COMMAND_ID105=""
CONFIG_CN_SPEECH_COMMAND_ID106=""
CONFIG_CN_SPEECH_COMMAND_ID107=""
CONFIG_CN_SPEECH_COMMAND_ID108=""
CONFIG_CN_SPEECH_COMMAND_ID109=""
CONFIG_CN_SPEECH_COMMAND_ID110=""
CONFIG_CN_SPEECH_COMMAND_ID111=""
CONFIG_CN_SPEECH_COMMAND_ID112=""
CONFIG_CN_SPEECH_COMMAND_ID113=""
CONFIG_CN_SPEECH_COMMAND_ID114=""
CONFIG_CN_SPEECH_COMMAND_ID115=""
CONFIG_CN_SPEECH_COMMAND_ID116=""
CONFIG_CN_SPEECH_COMMAND_ID117=""
CONFIG_CN_SPEECH_COMMAND_ID118=""
CONFIG_CN_SPEECH_COMMAND_ID119=""
CONFIG_CN_SPEECH_COMMAND_ID120=""
CONFIG_CN_SPEECH_COMMAND_ID121=""
CONFIG_CN_SPEECH_COMMAND_ID122=""
CONFIG_CN_SPEECH_COMMAND_ID123=""
CONFIG_CN_SPEECH_COMMAND_ID124=""
CONFIG_CN_SPEECH_COMMAND_ID125=""
CONFIG_CN_SPEECH_COMMAND_ID126=""
CONFIG_CN_SPEECH_COMMAND_ID127=""
CONFIG_CN_SPEECH_COMMAND_ID128=""
CONFIG_CN_SPEECH_COMMAND_ID129=""
CONFIG_CN_SPEECH_COMMAND_ID130=""
CONFIG_CN_SPEECH_COMMAND_ID131=""
CONFIG_CN_SPEECH_COMMAND_ID132=""
CONFIG_CN_SPEECH_COMMAND_ID133=""
CONFIG_CN_SPEECH_COMMAND_ID134=""
CONFIG_CN_SPEECH_COMMAND_ID135=""
CONFIG_CN_SPEECH_COMMAND_ID136=""
CONFIG_CN_SPEECH_COMMAND_ID137=""
CONFIG_CN_SPEECH_COMMAND_ID138=""
CONFIG_CN_SPEECH_COMMAND_ID139=""
CONFIG_CN_SPEECH_COMMAND_ID140=""
CONFIG_CN_SPEECH_COMMAND_ID141=""
CONFIG_CN_SPEECH_COMMAND_ID142=""
CONFIG_CN_SPEECH_COMMAND_ID143=""
CONFIG_CN_SPEECH_COMMAND_ID144=""
CONFIG_CN_SPEECH_COMMAND_ID145=""
CONFIG_CN_SPEECH_COMMAND_ID146=""
CONFIG_CN_SPEECH_COMMAND_ID147=""
CONFIG_CN_SPEECH_COMMAND_ID148=""
CONFIG_CN_SPEECH_COMMAND_ID149=""
CONFIG_CN_SPEECH_COMMAND_ID150=""
CONFIG_CN_SPEECH_COMMAND_ID151=""
CONFIG_CN_SPEECH_COMMAND_ID152=""
CONFIG_CN_SPEECH_COMMAND_ID153=""
CONFIG_CN_SPEECH_COMMAND_ID154=""
CONFIG_CN_SPEECH_COMMAND_ID155=""
CONFIG_CN_SPEECH_COMMAND_ID156=""
CONFIG_CN_SPEECH_COMMAND_ID157=""
CONFIG_CN_SPEECH_COMMAND_ID158=""
CONFIG_CN_SPEECH_COMMAND_ID159=""
CONFIG_CN_SPEECH_COMMAND_ID160=""
CONFIG_CN_SPEECH_COMMAND_ID161=""
CONFIG_CN_SPEECH_COMMAND_ID162=""
CONFIG_CN_SPEECH_COMMAND_ID163=""
CONFIG_CN_SPEECH_COMMAND_ID164=""
CONFIG_CN_SPEECH_COMMAND_ID165=""
CONFIG_CN_SPEECH_COMMAND_ID166=""
CONFIG_CN_SPEECH_COMMAND_ID167=""
CONFIG_CN_SPEECH_COMMAND_ID168=""
CONFIG_CN_SPEECH_COMMAND_ID169=""
CONFIG_CN_SPEECH_COMMAND_ID170=""
CONFIG_CN_SPEECH_COMMAND_ID171=""
CONFIG_CN_SPEECH_COMMAND_ID172=""
CONFIG_CN_SPEECH_COMMAND_ID173=""
CONFIG_CN_SPEECH_COMMAND_ID174=""
CONFIG_CN_SPEECH_COMMAND_ID175=""
CONFIG_CN_SPEECH_COMMAND_ID176=""
CONFIG_CN_SPEECH_COMMAND_ID177=""
CONFIG_CN_SPEECH_COMMAND_ID178=""
CONFIG_CN_SPEECH_COMMAND_ID179=""
CONFIG_CN_SPEECH_COMMAND_ID180=""
CONFIG_CN_SPEECH_COMMAND_ID181=""
CONFIG_CN_SPEECH_COMMAND_ID182=""
CONFIG_CN_SPEECH_COMMAND_ID183=""
CONFIG_CN_SPEECH_COMMAND_ID184=""
CONFIG_CN_SPEECH_COMMAND_ID185=""
CONFIG_CN_SPEECH_COMMAND_ID186=""
CONFIG_CN_SPEECH_COMMAND_ID187=""
CONFIG_CN_SPEECH_COMMAND_ID188=""
CONFIG_CN_SPEECH_COMMAND_ID189=""
CONFIG_CN_SPEECH_COMMAND_ID190=""
CONFIG_CN_SPEECH_COMMAND_ID191=""
CONFIG_CN_SPEECH_COMMAND_ID192=""
CONFIG_CN_SPEECH_COMMAND_ID193=""
CONFIG_CN_SPEECH_COMMAND_ID194=""
CONFIG_CN_SPEECH_COMMAND_ID195=""
CONFIG_CN_SPEECH_COMMAND_ID196=""
CONFIG_CN_SPEECH_COMMAND_ID197=""
CONFIG_CN_SPEECH_COMMAND_ID198=""
CONFIG_CN_SPEECH_COMMAND_ID199=""
# end of Add Chinese speech commands

#
# Add English speech commands
#
CONFIG_EN_SPEECH_COMMAND_ID0=""
CONFIG_EN_SPEECH_COMMAND_ID1=""
CONFIG_EN_SPEECH_COMMAND_ID2=""
CONFIG_EN_SPEECH_COMMAND_ID3=""
CONFIG_EN_SPEECH_COMMAND_ID4=""
CONFIG_EN_SPEECH_COMMAND_ID5=""
CONFIG_EN_SPEECH_COMMAND_ID6=""
CONFIG_EN_SPEECH_COMMAND_ID7=""
CONFIG_EN_SPEECH_COMMAND_ID8=""
CONFIG_EN_SPEECH_COMMAND_ID9=""
CONFIG_EN_SPEECH_COMMAND_ID10=""
CONFIG_EN_SPEECH_COMMAND_ID11=""
CONFIG_EN_SPEECH_COMMAND_ID12=""
CONFIG_EN_SPEECH_COMMAND_ID13=""
CONFIG_EN_SPEECH_COMMAND_ID14=""
CONFIG_EN_SPEECH_COMMAND_ID15=""
CONFIG_EN_SPEECH_COMMAND_ID16=""
CONFIG_EN_SPEECH_COMMAND_ID17=""
CONFIG_EN_SPEECH_COMMAND_ID18=""
CONFIG_EN_SPEECH_COMMAND_ID19=""
CONFIG_EN_SPEECH_COMMAND_ID20=""
CONFIG_EN_SPEECH_COMMAND_ID21=""
CONFIG_EN_SPEECH_COMMAND_ID22=""
CONFIG_EN_SPEECH_COMMAND_ID23=""
CONFIG_EN_SPEECH_COMMAND_ID24=""
CONFIG_EN_SPEECH_COMMAND_ID25=""
CONFIG_EN_SPEECH_COMMAND_ID26=""
CONFIG_EN_SPEECH_COMMAND_ID27=""
CONFIG_EN_SPEECH_COMMAND_ID28=""
CONFIG_EN_SPEECH_COMMAND_ID29=""
CONFIG_EN_SPEECH_COMMAND_ID30=""
CONFIG_EN_SPEECH_COMMAND_ID31=""
CONFIG_EN_SPEECH_COMMAND_ID32=""
CONFIG_EN_SPEECH_COMMAND_ID33=""
CONFIG_EN_SPEECH_COMMAND_ID34=""
CONFIG_EN_SPEECH_COMMAND_ID35=""
CONFIG_EN_SPEECH_COMMAND_ID36=""
CONFIG_EN_SPEECH_COMMAND_ID37=""
CONFIG_EN_SPEECH_COMMAND_ID38=""
CONFIG_EN_SPEECH_COMMAND_ID39=""
CONFIG_EN_SPEECH_COMMAND_ID40=""
CONFIG_EN_SPEECH_COMMAND_ID41=""
CONFIG_EN_SPEECH_COMMAND_ID42=""
CONFIG_EN_SPEECH_COMMAND_ID43=""
CONFIG_EN_SPEECH_COMMAND_ID44=""
CONFIG_EN_SPEECH_COMMAND_ID45=""
CONFIG_EN_SPEECH_COMMAND_ID46=""
CONFIG_EN_SPEECH_COMMAND_ID47=""
CONFIG_EN_SPEECH_COMMAND_ID48=""
CONFIG_EN_SPEECH_COMMAND_ID49=""
CONFIG_EN_SPEECH_COMMAND_ID50=""
CONFIG_EN_SPEECH_COMMAND_ID51=""
CONFIG_EN_SPEECH_COMMAND_ID52=""
CONFIG_EN_SPEECH_COMMAND_ID53=""
CONFIG_EN_SPEECH_COMMAND_ID54=""
CONFIG_EN_SPEECH_COMMAND_ID55=""
CONFIG_EN_SPEECH_COMMAND_ID56=""
CONFIG_EN_SPEECH_COMMAND_ID57=""
CONFIG_EN_SPEECH_COMMAND_ID58=""
CONFIG_EN_SPEECH_COMMAND_ID59=""
CONFIG_EN_SPEECH_COMMAND_ID60=""
CONFIG_EN_SPEECH_COMMAND_ID61=""
CONFIG_EN_SPEECH_COMMAND_ID62=""
CONFIG_EN_SPEECH_COMMAND_ID63=""
CONFIG_EN_SPEECH_COMMAND_ID64=""
CONFIG_EN_SPEECH_COMMAND_ID65=""
CONFIG_EN_SPEECH_COMMAND_ID66=""
CONFIG_EN_SPEECH_COMMAND_ID67=""
CONFIG_EN_SPEECH_COMMAND_ID68=""
CONFIG_EN_SPEECH_COMMAND_ID69=""
CONFIG_EN_SPEECH_COMMAND_ID70=""
CONFIG_EN_SPEECH_COMMAND_ID71=""
CONFIG_EN_SPEECH_COMMAND_ID72=""
CONFIG_EN_SPEECH_COMMAND_ID73=""
CONFIG_EN_SPEECH_COMMAND_ID74=""
CONFIG_EN_SPEECH_COMMAND_ID75=""
CONFIG_EN_SPEECH_COMMAND_ID76=""
CONFIG_EN_SPEECH_COMMAND_ID77=""
CONFIG_EN_SPEECH_COMMAND_ID78=""
CONFIG_EN_SPEECH_COMMAND_ID79=""
CONFIG_EN_SPEECH_COMMAND_ID80=""
CONFIG_EN_SPEECH_COMMAND_ID81=""
CONFIG_EN_SPEECH_COMMAND_ID82=""
CONFIG_EN_SPEECH_COMMAND_ID83=""
CONFIG_EN_SPEECH_COMMAND_ID84=""
CONFIG_EN_SPEECH_COMMAND_ID85=""
CONFIG_EN_SPEECH_COMMAND_ID86=""
CONFIG_EN_SPEECH_COMMAND_ID87=""
CONFIG_EN_SPEECH_COMMAND_ID88=""
CONFIG_EN_SPEECH_COMMAND_ID89=""
CONFIG_EN_SPEECH_COMMAND_ID90=""
CONFIG_EN_SPEECH_COMMAND_ID91=""
CONFIG_EN_SPEECH_COMMAND_ID92=""
CONFIG_EN_SPEECH_COMMAND_ID93=""
CONFIG_EN_SPEECH_COMMAND_ID94=""
CONFIG_EN_SPEECH_COMMAND_ID95=""
CONFIG_EN_SPEECH_COMMAND_ID96=""
CONFIG_EN_SPEECH_COMMAND_ID97=""
CONFIG_EN_SPEECH_COMMAND_ID98=""
CONFIG_EN_SPEECH_COMMAND_ID99=""
CONFIG_EN_SPEECH_COMMAND_ID100=""
CONFIG_EN_SPEECH_COMMAND_ID101=""
CONFIG_EN_SPEECH_COMMAND_ID102=""
CONFIG_EN_SPEECH_COMMAND_ID103=""
CONFIG_EN_SPEECH_COMMAND_ID104=""
CONFIG_EN_SPEECH_COMMAND_ID105=""
CONFIG_EN_SPEECH_COMMAND_ID106=""
CONFIG_EN_SPEECH_COMMAND_ID107=""
CONFIG_EN_SPEECH_COMMAND_ID108=""
CONFIG_EN_SPEECH_COMMAND_ID109=""
CONFIG_EN_SPEECH_COMMAND_ID110=""
CONFIG_EN_SPEECH_COMMAND_ID111=""
CONFIG_EN_SPEECH_COMMAND_ID112=""
CONFIG_EN_SPEECH_COMMAND_ID113=""
CONFIG_EN_SPEECH_COMMAND_ID114=""
CONFIG_EN_SPEECH_COMMAND_ID115=""
CONFIG_EN_SPEECH_COMMAND_ID116=""
CONFIG_EN_SPEECH_COMMAND_ID117=""
CONFIG_EN_SPEECH_COMMAND_ID118=""
CONFIG_EN_SPEECH_COMMAND_ID119=""
CONFIG_EN_SPEECH_COMMAND_ID120=""
CONFIG_EN_SPEECH_COMMAND_ID121=""
CONFIG_EN_SPEECH_COMMAND_ID122=""
CONFIG_EN_SPEECH_COMMAND_ID123=""
CONFIG_EN_SPEECH_COMMAND_ID124=""
CONFIG_EN_SPEECH_COMMAND_ID125=""
CONFIG_EN_SPEECH_COMMAND_ID126=""
CONFIG_EN_SPEECH_COMMAND_ID127=""
CONFIG_EN_SPEECH_COMMAND_ID128=""
CONFIG_EN_SPEECH_COMMAND_ID129=""
CONFIG_EN_SPEECH_COMMAND_ID130=""
CONFIG_EN_SPEECH_COMMAND_ID131=""
CONFIG_EN_SPEECH_COMMAND_ID132=""
CONFIG_EN_SPEECH_COMMAND_ID133=""
CONFIG_EN_SPEECH_COMMAND_ID134=""
CONFIG_EN_SPEECH_COMMAND_ID135=""
CONFIG_EN_SPEECH_COMMAND_ID136=""
CONFIG_EN_SPEECH_COMMAND_ID137=""
CONFIG_EN_SPEECH_COMMAND_ID138=""
CONFIG_EN_SPEECH_COMMAND_ID139=""
CONFIG_EN_SPEECH_COMMAND_ID140=""
CONFIG_EN_SPEECH_COMMAND_ID141=""
CONFIG_EN_SPEECH_COMMAND_ID142=""
CONFIG_EN_SPEECH_COMMAND_ID143=""
CONFIG_EN_SPEECH_COMMAND_ID144=""
CONFIG_EN_SPEECH_COMMAND_ID145=""
CONFIG_EN_SPEECH_COMMAND_ID146=""
CONFIG_EN_SPEECH_COMMAND_ID147=""
CONFIG_EN_SPEECH_COMMAND_ID148=""
CONFIG_EN_SPEECH_COMMAND_ID149=""
CONFIG_EN_SPEECH_COMMAND_ID150=""
CONFIG_EN_SPEECH_COMMAND_ID151=""
CONFIG_EN_SPEECH_COMMAND_ID152=""
CONFIG_EN_SPEECH_COMMAND_ID153=""
CONFIG_EN_SPEECH_COMMAND_ID154=""
CONFIG_EN_SPEECH_COMMAND_ID155=""
CONFIG_EN_SPEECH_COMMAND_ID156=""
CONFIG_EN_SPEECH_COMMAND_ID157=""
CONFIG_EN_SPEECH_COMMAND_ID158=""
CONFIG_EN_SPEECH_COMMAND_ID159=""
CONFIG_EN_SPEECH_COMMAND_ID160=""
CONFIG_EN_SPEECH_COMMAND_ID161=""
CONFIG_EN_SPEECH_COMMAND_ID162=""
CONFIG_EN_SPEECH_COMMAND_ID163=""
CONFIG_EN_SPEECH_COMMAND_ID164=""
CONFIG_EN_SPEECH_COMMAND_ID165=""
CONFIG_EN_SPEECH_COMMAND_ID166=""
CONFIG_EN_SPEECH_COMMAND_ID167=""
CONFIG_EN_SPEECH_COMMAND_ID168=""
CONFIG_EN_SPEECH_COMMAND_ID169=""
CONFIG_EN_SPEECH_COMMAND_ID170=""
CONFIG_EN_SPEECH_COMMAND_ID171=""
CONFIG_EN_SPEECH_COMMAND_ID172=""
CONFIG_EN_SPEECH_COMMAND_ID173=""
CONFIG_EN_SPEECH_COMMAND_ID174=""
CONFIG_EN_SPEECH_COMMAND_ID175=""
CONFIG_EN_SPEECH_COMMAND_ID176=""
CONFIG_EN_SPEECH_COMMAND_ID177=""
CONFIG_EN_SPEECH_COMMAND_ID178=""
CONFIG_EN_SPEECH_COMMAND_ID179=""
CONFIG_EN_SPEECH_COMMAND_ID180=""
CONFIG_EN_SPEECH_COMMAND_ID181=""
CONFIG_EN_SPEECH_COMMAND_ID182=""
CONFIG_EN_SPEECH_COMMAND_ID183=""
CONFIG_EN_SPEECH_COMMAND_ID184=""
CONFIG_EN_SPEECH_COMMAND_ID185=""
CONFIG_EN_SPEECH_COMMAND_ID186=""
CONFIG_EN_SPEECH_COMMAND_ID187=""
CONFIG_EN_SPEECH_COMMAND_ID188=""
CONFIG_EN_SPEECH_COMMAND_ID189=""
CONFIG_EN_SPEECH_COMMAND_ID190=""
CONFIG_EN_SPEECH_COMMAND_ID191=""
CONFIG_EN_SPEECH_COMMAND_ID192=""
CONFIG_EN_SPEECH_COMMAND_ID193=""
CONFIG_EN_SPEECH_COMMAND_ID194=""
CONFIG_EN_SPEECH_COMMAND_ID195=""
CONFIG_EN_SPEECH_COMMAND_ID196=""
CONFIG_EN_SPEECH_COMMAND_ID197=""
CONFIG_EN_SPEECH_COMMAND_ID198=""
CONFIG_EN_SPEECH_COMMAND_ID199=""
# end of Add English speech commands
# end of ESP Speech Recognition

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# CONFIG_COMPILER_CXX_RTTI is not set
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# end of Compiler options

#
# Component config
#

#
# Application Level Tracing
#
# CONFIG_APPTRACE_DEST_JTAG is not set
CONFIG_APPTRACE_DEST_NONE=y
# CONFIG_APPTRACE_DEST_UART0 is not set
# CONFIG_APPTRACE_DEST_UART1 is not set
# CONFIG_APPTRACE_DEST_UART2 is not set
# CONFIG_APPTRACE_DEST_USB_CDC is not set
CONFIG_APPTRACE_DEST_UART_NONE=y
CONFIG_APPTRACE_UART_TASK_PRIO=1
CONFIG_APPTRACE_LOCK_ENABLE=y
# end of Application Level Tracing

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_CONTROLLER_ONLY is not set
CONFIG_BT_CONTROLLER_ENABLED=y
# CONFIG_BT_CONTROLLER_DISABLED is not set

